export let enAdvert = 0; // 是否显示广告(0-不显示；1-显示)

export let queryACIP = 0; // 多AC认证是否存储参数(0-不存储，1-存储)

export let accountPrefix = 1; // 是否添加账号前缀(0-不添加；1-添加)

export let apiUrl = "http://p.njupt.edu.cn:801/eportal/?" // 请求api地址;

// @ts-ignore
let checkScanIP: string;
checkScanIP = apiUrl + "c=ACSetting&a=checkScanIP&wlanuserip=";

// @ts-ignore
let ipPageAry: string[];
ipPageAry = [
  "默认模版|1.1.1.1|255.255.255.254|000||1|0",
  "njupt-仙林办公|10.164.0.1|10.164.223.254|||1|1",
  "njupt-guest-仙林|10.164.224.1|10.164.255.254|||1|1",
  "njupt-三牌楼宿舍|10.131.0.1|10.132.223.254|||1|1",
  "njupt-chinanet-仙林|10.165.0.1|10.165.255.254|000njxy||1|1",
  "njupt-cmcc-仙林|10.163.0.1|10.163.255.254|000cmcc||1|1",
  "宿舍区有线-仙林|10.161.0.1|10.161.255.254|||1|1",
  "njupt-cmcc-三牌楼|10.133.0.1|10.133.255.254|000cmcc||1|1",
  "有线网关认证地址段1|10.0.0.1|10.130.255.254|||1|1",
  "njupt-仙林宿舍|10.162.0.1|10.162.255.254|||1|1",
  "njupt-guest-三牌楼|10.132.224.1|10.132.255.254|||1|1",
  "njupt-chinanet-三牌楼|10.136.0.1|10.136.255.254|000njxy||1|1",
  "有线网关认证地址段2|10.137.0.1|10.161.255.254|||1|1",
  "有线网关认证地址段3|10.166.0.1|10.255.255.254|||1|1"
];
